[M_ListenToGrandmaRaid MissionDefinition]
MissionName="Grandmother's Story: The Severity of the Attack"
MissionDescription="Patty Flushington's story is different. Bring your friends."
TurnInDescription="beauty!"
MissionSummary="Listen to the story of the second grandmother."
MissionGiver="Mr. Flessington"
MissionTurnInLocation="David Flexington"
TeaserText="Do you have the patience to endure another Grandma Flexington story??"

[M_ListenToGrandmaRaid:BringBackCandy MissionObjectiveDefinition]
ProgressMessage="Bring back the milk."

[M_ListenToGrandmaRaid:FindCandy MissionObjectiveDefinition]
ProgressMessage="Take Schwartzman's Caramel."

[M_ListenToGrandmaRaid:FindCandyDrop MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride="Grandma Flexington is another story for you, but she has candy too. He asks you to find Candy Schwartzman.."

[M_ListenToGrandmaRaid:GatherGrandma MissionObjectiveDefinition]
ProgressMessage="I'm with Patty Flushington"

[M_ListenToGrandmaRaid:KillGrandmaTributes MissionObjectiveDefinition]
ProgressMessage="less tax"

[M_ListenToGrandmaRaid:MissionObjectiveSetDefinition_0 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_ListenToGrandmaRaid:MissionObjectiveSetDefinition_1 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_ListenToGrandmaRaid:MissionObjectiveSetDefinition_2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_ListenToGrandmaRaid:MissionObjectiveSetDefinition_3 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_ListenToGrandmaRaid:MissionObjectiveSetDefinition_4 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride="Grandma Flexington has another story for you. Bring your friend."

[M_ListenToGrandmaRaid:MissionObjectiveSetDefinition_5 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_ListenToGrandmaRaid:RaidListentoStory MissionObjectiveDefinition]
ProgressMessage="Listen to this story about the grandmother"

